import logo from './logo.svg';
import './App.css';
import MagicBall from './components/MagicBall';

function App() {
  return (
    <MagicBall/>
  );
}

export default App;


// Створи застосунок «Магічний шар», який при натисканні кнопки показує випадкове передбачення.

// Інтерфейс має складатися з трьох компонентів:

// 1. MagicBall

//   Це головний компонент з логікою:
//    - містить масив фраз-передбачень
//    - зберігає у стані поточне передбачення
//    - має функцію getRandomPrediction(), яка випадково обирає фразу
//    - рендерить кнопку «Задати питання»
//    - передає поточне передбачення в компонент Prediction

// 2. Prediction
//  Показує текст передбачення в красивому стилі (наприклад, у рамці).

// 3. App
//  Просто виводить <MagicBall />.


// Початковий стан — пустий текст або “Задай питання”.


// Масив можливих передбачень:
// const predictions = [
//   "Так, без сумнівів!",
//   "Звісно, так.",
//   "Можливо…",
//   "Запитай пізніше.",
//   "Не варто на це розраховувати.",
//   "Ні.",
//   "Шанси невеликі.",
//   "Абсолютно точно!"
// ];